---
kind: method
id: M:Autodesk.Revit.DB.PointClouds.PointCloudOverrides.#ctor
source: html/8034b037-5470-8587-694e-0160a5aeae35.htm
---
# Autodesk.Revit.DB.PointClouds.PointCloudOverrides.#ctor Method

Constructs empty overrides object.

## Syntax (C#)
```csharp
public PointCloudOverrides()
```